Reports/АнализСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Report>
		<Properties>
			<Name>АнализСотрудники</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>Сотрудники</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяСтавка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/АнализСотрудники/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрыПоУмолчанию();                                   
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыПоУмолчанию(Принудительно = Ложь)
	ГодЗадачи = Год(ТекущаяДата());
	СКД_ЗначенияСправочника("Справочник.Организации", Организация, Принудительно, Справочники.Организации.ПустаяСсылка());     
	СКД_ЗначенияСправочника("Справочник.СтатусыСотрудников", СтатусСотрудника, Принудительно);     
	
	Запрос = "ВЫБРАТЬ
	         |	СотрудникиСрезПоследних.Подразделение.Ссылка КАК Ссылка
	         |ИЗ
	         |	РегистрСведений.Сотрудники.СрезПоследних КАК СотрудникиСрезПоследних
	         |
	         |СГРУППИРОВАТЬ ПО
	         |	СотрудникиСрезПоследних.Подразделение.Ссылка
	         |
	         |УПОРЯДОЧИТЬ ПО
	         |	СотрудникиСрезПоследних.Подразделение.Наименование";
	СКД_ЗначенияЗапрос(Запрос, Подразделение, Принудительно);     
	
	Запрос = "ВЫБРАТЬ
	         |	СотрудникиСрезПоследних.ТарифнаяСтавка.Ссылка КАК Ссылка
	         |ИЗ
	         |	РегистрСведений.Сотрудники.СрезПоследних КАК СотрудникиСрезПоследних
	         |
	         |СГРУППИРОВАТЬ ПО
	         |	СотрудникиСрезПоследних.ТарифнаяСтавка.Ссылка
	         |
	         |УПОРЯДОЧИТЬ ПО
	         |	СотрудникиСрезПоследних.ТарифнаяСтавка.Наименование";
	СКД_ЗначенияЗапрос(Запрос, ТарифнаяСтавка, Принудительно);     
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	мРеквизиты = ЭтотОбъект.ПолучитьРеквизиты();
	сзПараметры = Новый СписокЗначений();
	Для Каждого реквизит Из мРеквизиты Цикл 
		сзПараметры.Добавить(реквизит.Имя);
	КонецЦикла;
	
	Для Каждого Эл ИЗ Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если сзПараметры.НайтиПоЗначению(Строка(Эл.Параметр)) <> Неопределено Тогда 
			параметр = ЭтотОбъект[Строка(Эл.Параметр)];
			Если ТипЗнч(Эл.Значение) = Тип("СписокЗначений") Тогда 
				Эл.Значение.Очистить();
				Для Каждого элСписка Из параметр Цикл 
					Если элСписка.Отметка Тогда 
						Если элСписка.Свойство("Ссылка") Тогда 
							Эл.Значение.добавить(элСписка.Значение.Ссылка);
						Иначе 
							Эл.Значение.добавить(элСписка.Значение);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			Иначе 
				Эл.Значение = параметр;
			КонецЕсли;
			Эл.Использование = Истина;
		Иначе 
			Сообщить("Параметр '" + Строка(Эл.Параметр) + "' не найден.")
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ПриОбновленииСоставаПользовательскихНастроекНаСервере("");
КонецПроцедуры

&НаКлиенте
Процедура кмдУстановитьПараметрыПоУмолчанию(Команда)
	УстановитьПараметрыПоУмолчанию(Истина);
КонецПроцедуры
